package com.zzq.constant;

/**
 * Author：zzq
 * Date:2019/7/17
 * Des:
 */
public class Constant {
    public static final String[] familyNames = new String[]{
            "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
            "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
            "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
            "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
            "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹",
            "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "计", "伏", "成", "戴", "谈", "宋", "茅", "庞",
            "熊", "纪", "舒", "屈", "项", "祝", "董", "粱", "杜", "阮", "蓝", "闵", "席", "季", "麻", "强", "贾", "路", "娄", "危",
            "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "钟", "徐", "邱", "骆", "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍",
            "虞", "万", "支", "柯", "昝", "管", "卢", "莫", "经", "房", "裘", "缪", "干", "解", "应", "宗", "丁", "宣", "贲", "邓",
            "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉", "钮", "龚", "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁",
            "荀", "羊", "於", "惠", "甄", "麴", "家", "封", "芮", "羿", "储", "靳", "汲", "邴", "糜", "松", "井", "段", "富", "巫",
            "乌", "焦", "巴", "弓", "牧", "隗", "山", "谷", "车", "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋", "仲", "伊", "宫",
            "宁", "仇", "栾", "暴", "甘", "钭", "厉", "戎", "祖", "武", "符", "刘", "景", "詹", "束", "龙", "叶", "幸", "司", "韶",
            "郜", "黎", "蓟", "薄", "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂", "索", "咸", "籍", "赖", "卓", "蔺", "屠", "蒙",
            "池", "乔", "阴", "欎", "胥", "能", "苍", "双", "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄", "姬", "申", "扶", "堵",
            "冉", "宰", "郦", "雍", "舄", "璩", "桑", "桂", "濮", "牛", "寿", "通", "边", "扈", "燕", "冀", "郏", "浦", "尚", "农",
            "温", "别", "庄", "晏", "柴", "瞿", "阎", "充", "慕", "连", "茹", "习", "宦", "艾", "鱼", "容", "向", "古", "易", "慎",
            "戈", "廖", "庾", "终", "暨", "居", "衡", "步", "都", "耿", "满", "弘", "匡", "国", "文", "寇", "广", "禄", "阙", "东",
            "殴", "殳", "沃", "利", "蔚", "越", "夔", "隆", "师", "巩", "厍", "聂", "晁", "勾", "敖", "融", "冷", "訾", "辛", "阚",
            "那", "简", "饶", "空", "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰", "巢", "关", "蒯", "相", "查", "後", "荆", "红",
            "游", "竺", "权", "逯", "盖", "益", "桓", "公", "万俟", "司马", "上官", "欧阳", "夏侯", "诸葛",
            "闻人", "东方", "赫连", "皇甫", "尉迟", "公羊", "澹台", "公冶", "宗政", "濮阳",
            "淳于", "单于", "太叔", "申屠", "公孙", "仲孙", "轩辕", "令狐", "钟离", "宇文",
            "长孙", "慕容", "鲜于", "闾丘", "司徒", "司空", "亓官", "司寇", "仉", "督", "子车",
            "颛孙", "端木", "巫马", "公西", "漆雕", "乐正", "壤驷", "公良", "拓跋", "夹谷",
            "宰父", "谷梁", "晋", "楚", "闫", "法", "汝", "鄢", "涂", "钦", "段干", "百里", "东郭", "南门",
            "呼延", "归", "海", "羊舌", "微生", "岳", "帅", "缑", "亢", "况", "后", "有", "琴", "梁丘", "左丘",
            "东门", "西门", "商", "牟", "佘", "佴", "伯", "赏", "南宫", "墨", "哈", "谯", "笪", "年", "爱", "阳", "佟",
    };
    public static final String[] names = new String[]{
            "彬蔚", "彬彬", "博裕", "博闻", "博容", "博文", "博艺", "博雅", "承德", "朝宗", "澄泓", "存志", "澹雅",
            "得韬", "德辉", "方旭", "飞轩", "芳华", "芳蕤", "芳苓", "芳蔼", "芳菲", "管彤", "和畅", "涵畅", "涵涵",
            "浩初", "浩丽", "浩然", "浩学", "泓涵", "泓浵", "慧艳", "慧语", "嘉言", "嘉懿", "江沅", "瑾瑜", "景铄",
            "静淞", "隽秀", "俊材", "俊慧", "俊杰", "俊丽", "俊爽", "俊伟", "俊雄", "俊誉", "峻雅", "凯歌", "凯凯",
            "凯泽", "孔阳", "可佳", "澜清", "澜飜", "乐心", "乐仪", "乐容", "乐欣", "乐康", "乐成", "霖霖", "灵犀",
            "落霞", "曼丽", "曼衍", "曼吟", "曼语", "琦玮", "清芬", "清妍", "清扬", "清越", "清芷", "晴岚", "琪华",
            "晴飔", "如山", "若飞", "若光", "若华", "胜蓝", "斯年", "腾起", "腾文", "腾扬", "腾逸", "恬简", "恬如",
            "恬适", "恬雅", "婉慧", "婉静", "婉妙", "婉然", "婉柔", "婉仪", "婉悦", "万里", "望舒", "文彬", "文翰",
            "文澜", "文丽", "文心", "文轩", "文雅", "文懿", "娴雅", "昕昕", "欣怡", "馨逸", "信芳", "星驰", "星阑",
            "星轩", "修远", "煦涵", "雅醇", "雅歌", "雅厚", "雅亮", "雅胜", "怡然", "弈鸣", "熠然", "懿美", "潆泓",
            "颖逸", "余馨", "羽丰", "语心", "悠然", "悠永", "悠柔", "煜月", "韫玉", "悦心", "悦欣", "悦畅", "悦爱",
            "震烨", "志鹏", "致远", "钟灵", "钟毓", "周翰", "周晟", "朱轩", "子衿", "自清", "自珍", "自修", "智敏",
            "朝辉", "志尚", "志行", "志致"};
}
